Extensions/ИнтеграцияGreenApi/Catalogs/iga_ЭтапыСценария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ЭтапыСценария</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередОбработкойЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослеОбработкиЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыТекстаЭтапа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКодПосле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_КомандыОбработкиОтвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующийЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_ЭтапыСценария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПослеОбработкиКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверочныйКодПосле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПроизвольногоТекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИсточник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыТекстаЭтапа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыТекстаЭтапа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шаблон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ЭтапыСценария/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстСообщенияHTML = iga_HTMLКлиент.ПолучитьИзначальныйТексСтраницы(Истина);
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСообщенияДокументСформирован(Элемент)
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(Объект.ТекстСообщения, Элементы.ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПараметров(ТекстСообщения)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Используем регулярное выражение для поиска текста в фигурных скобках
	// Шаблон \{([^}]+)\} означает: найти "{", захватить всё, что не является "}", и найти "}"
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Истина; // Игнорировать регистр
	RegExp.Global     = Истина; // Искать все вхождения
	RegExp.MultiLine  = Истина;
	RegExp.Pattern    = "\{([^}]+)\}";
	
	Попытка
		Matches = RegExp.Execute(ТекстСообщения);
	Исключение
		Сообщить("Ошибка при разборе текста алгоритма: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	СтарыеПараметры = Новый Соответствие;
	Для Каждого СтрокаПараметра Из Объект.ПараметрыПроизвольногоТекста Цикл
		СтруктураСтроки = Новый Структура("ЗначениеИсточник");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаПараметра);
		СтарыеПараметры.Вставить(СтрокаПараметра.ИмяПараметра, СтруктураСтроки);
	КонецЦикла;
	
	Объект.ПараметрыПроизвольногоТекста.Очистить();
	
	СтруктураПоиска = Новый Структура("ИмяПараметра");
	
	СчетчикПараметров = 0;
	Для Каждого Match Из Matches Цикл
	
		ИмяИзТекста = Match.SubMatches(0);
		
		СтруктураПоиска.ИмяПараметра = ИмяИзТекста;
		Если Объект.ПараметрыПроизвольногоТекста.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СчетчикПараметров = СчетчикПараметров + 1;
		
		СтрокаПараметра = Объект.ПараметрыПроизвольногоТекста.Добавить();
		СтрокаПараметра.ИмяПараметра = ИмяИзТекста;
		СтарыеЗначения = СтарыеПараметры.Получить(СтрокаПараметра.ИмяПараметра);
		Если Не СтарыеЗначения = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПараметра, СтарыеЗначения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Обработчик_ПослеВводаТекста(ТекстСообщения, ДопПараметры) Экспорт 
	
	Если ТекстСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекстСообщения = ТекстСообщения;
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(Объект.ТекстСообщения, Элементы.ТекстСообщения);
	
	ОбновитьСписокПараметров(ТекстСообщения);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаТекста", ЭтаФорма);
	
	ОткрытьФорму("Обработка.iga_РедакторТекстаHTML.Форма.Форма", Новый Структура("ТекстДляРедактирования", Объект.ТекстСообщения), ЭтаФорма,
		,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАлгоритм(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПередОбработкойЭтапа Тогда
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, ТекстСообщения, ВыборКнопки"")
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, "ПередОбработкойЭтапа", Подсказка);
	Иначе
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, СледующийЭтап, ТекстСообщения, ВыборКнопки"") 
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, "ПослеОбработкиЭтапа", Подсказка, "ПроверочныйКодПосле");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ПростойТекст = Не Объект.ТипСообщения = ПредопределенноеЗначение("Перечисление.iga_ТипыТекстаЭтапа.Шаблон");
	
	Элементы.ГруппТекстСообщения.Видимость = ПростойТекст;
	Элементы.ШаблонСообщения.Видимость = Не ПростойТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПроизвольногоТекстаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПроизвольногоТекстаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовПослеОбработкиКомандыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПередОбработкойЭтапа Тогда
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, ТекстСообщения, ВыборКнопки"")
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Элементы.ВариантыОтветов.ТекущиеДанные, "ПослеОбработкиКоманды", Подсказка);
	Иначе
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, СледующийЭтап, ТекстСообщения, ВыборКнопки"") 
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Элементы.ВариантыОтветов.ТекущиеДанные, "ПослеОбработкиКоманды", Подсказка, "ПроверочныйКодПосле");
	КонецЕсли;
КонецПроцедуры
